results/M2.0_0.25881904510252074/0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0";
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1.99781;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1.99781;
    }
    sym
    {
        type            symmetry;
    }
    wedge
    {
        type            calculated;
        value           nonuniform List<scalar> 
80
(
1.93408
1.93408
1.93408
1.93408
1.93408
1.93408
1.93408
1.93408
...
)
;
    }
    top
    {
        type            calculated;
        value           uniform 1.99781;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
    outlet
    {
        type            calculated;
        value           uniform 1.99781;
    }
}


// ************************************************************************* //
